knyghtryda/oepl-cc2630-firmware/firmware/main.c
        // 3. the plane the panel is fed from, a row at a time
        uint32_t n = len;
        for (uint32_t i = 0; i < n; i++) {
            zsink.row[zsink.row_len++] = data[i];
            if (zsink.row_len == row_bytes) {
                if (zsink.row_y >= DISPLAY_HEIGHT_600X448) {
                    zsink.failed = true;
                    return false;
                }
                zsink_emit_row();
            }
        }
        data += n; len -= n; zsink.off += n;
    }
    return !zsink.failed;
}

// Stage a compressed image in flash, decode it into the panel, refresh.
// Returns true only if the whole stream decoded and checksummed.
static bool download_and_display_zlib(struct AvailDataInfo *info)
{
    rtt_puts("ZIMG: staging ");
    rtt_put_hex32(info->dataSize);
    rtt_puts(" bytes\r\n");

    if (!oepl_ota_stage_download(info, IMG_ZLIB_IN_ADDR, IMG_ZLIB_IN_MAX))
        return false;

    oepl_flash_cache_invalidate();
    const uint8_t *in = (const uint8_t *)IMG_ZLIB_IN_ADDR;
    uint32_t total = (uint32_t)in[0] | ((uint32_t)in[1] << 8) |
                     ((uint32_t)in[2] << 16) | ((uint32_t)in[3] << 24);

    memset(&zsink, 0, sizeof(zsink));

    rtt_puts("EPD wake...");
    uc8159_wake();
    rtt_puts("OK\r\n");

    uint32_t produced = 0;
    // red_buf is the decoder's 4 KB window: nothing else needs it here, and a
    // second 4 KB buffer would not fit in RAM.
    int rc = inflate_zlib(in + 4, info->dataSize - 4, red_buf, 4096,
                          zlib_sink, NULL, total, &produced);

    if (zsink.panel_open) oepl_hw_spi_cs_deassert();

    if (rc != INFLATE_OK || zsink.failed || zsink.row_y != DISPLAY_HEIGHT_600X448) {
        rtt_puts("\r\nZIMG: decode failed rc=");
        rtt_put_hex8((uint8_t)(-rc));
        rtt_puts(" rows=");
        rtt_put_hex32(zsink.row_y);
        rtt_puts(" out=");
        rtt_put_hex32(produced);
        rtt_puts(" -- not refreshing\r\n");
        uc8159_sleep();
        return false;
    }

    rtt_puts("\r\nZIMG: decoded ");
    rtt_put_hex32(produced);
    rtt_puts(" bytes, checksum OK\r\n");

    // Refresh first, then tell the AP: transmitting during the refresh's peak
    // current loses the frame (see download_and_display).
    uc8159_refresh_and_sleep();
    rtt_puts(oepl_radio_send_xfer_complete()
                 ? "XferComplete ACKed\r\n"
                 : "XferComplete NOT acked (AP will re-offer)\r\n");
    return true;
}

// --- NFC content from the AP ---
//
// OEPL's web UI offers "Set NFC URL" (content mode 14) to any tag that
// reports CAPABILITY_HAS_NFC, and sends the result as DATATYPE_NFC_RAW_CONTENT:
// the bytes are already a finished NDEF TLV (03 <len> D1 01 <len> 55 <prefix>
// <url> FE), so the tag just copies them into the chip's user memory.
// DATATYPE_NFC_URL_DIRECT hands over a bare URL instead and leaves the record
// to us.
static bool download_and_write_nfc(struct AvailDataInfo *info)
{
    if (!oepl_nfc_present()) {
        rtt_puts("NFC: content offered but no chip here\r\n");
        return false;
    }
    uint32_t len = info->dataSize;
    if (len == 0 || len > BLOCK_DATA_SIZE) {
        rtt_puts("NFC: content size out of range\r\n");
        return false;
    }

    bw_cache_id = -1;
    if (!ensure_bw_block(0, info)) {
        rtt_puts("NFC: download failed\r\n");
        return false;
    }
    const uint8_t *payload = &bw_buf[BLOCK_HEADER_SIZE];

    bool ok;
    if (info->dataType == DATATYPE_NFC_URL_DIRECT) {
        // bare URL: wrap it in a URI record ourselves (prefix byte 0 = none)
        uint8_t rec[BLOCK_DATA_SIZE > 256 ? 256 : BLOCK_DATA_SIZE];
        if (len + 9 > sizeof(rec)) return false;
        uint16_t n = 0;
        rec[n++] = 0x03;
        rec[n++] = (uint8_t)(len + 5);
        rec[n++] = 0xD1;
        rec[n++] = 0x01;
        rec[n++] = (uint8_t)(len + 1);
        rec[n++] = 0x55;              // URI record
        rec[n++] = 0x00;              // no prefix substitution
        for (uint32_t i = 0; i < len; i++) rec[n++] = payload[i];
        rec[n++] = 0xFE;
        ok = oepl_nfc_write_user(rec, n);
    } else {
        ok = oepl_nfc_write_user(payload, (uint16_t)len);
    }

    if (ok) {
        rtt_puts("NFC: content written\r\n");
        rtt_puts(oepl_radio_send_xfer_complete()
                     ? "XferComplete ACKed\r\n"
                     : "XferComplete NOT acked (AP will re-offer)\r\n");
    } else {
        rtt_puts("NFC: write failed\r\n");
    }
    return ok;
}

// Put the tag's own identity in the chip, so tapping an unresponsive or flat
// tag still says what it is. The chip answers from the reader's field alone.
static void nfc_write_identity(void)
{
    if (!oepl_nfc_present()) return;

    // Don't overwrite content the AP pushed. "Set NFC URL" writes a URI
    // record (type 'U', 0x55) that is meant to outlive a reboot -- the chip
    // is non-volatile, so a tag can be given a URL once and put back into
    // display mode. Only an empty chip or our own text record gets replaced.
    uint8_t blk[NFC_BLOCK_SIZE];
    if (oepl_nfc_read_block(NFC_FIRST_USER_BLK, blk) &&
        blk[0] == 0x03 && blk[5] == 0x55) {
        rtt_puts("NFC: leaving the URL the AP pushed\r\n");
        return;
    }

    uint8_t mac[8];
    oepl_rf_get_mac(mac);
    int8_t tc = 0;
    uint16_t mv = 0;
    oepl_hw_get_temperature(&tc);
    oepl_hw_get_voltage(&mv);

    static const char hexd[] = "0123456789ABCDEF";
    char text[64];
    char *q = text;
    const char *p = "OEPL ";
    while (*p) *q++ = *p++;
    for (int i = 7; i >= 0; i--) { *q++ = hexd[mac[i] >> 4]; *q++ = hexd[mac[i] & 15]; }
    p = "  v";
    while (*p) *q++ = *p++;
    *q++ = (char)('0' + ((TAG_FW_VERSION & 0xFF) / 10));
    *q++ = (char)('0' + ((TAG_FW_VERSION & 0xFF) % 10));
    *q++ = ' '; *q++ = ' ';
    *q++ = (char)('0' + (mv / 1000)); *q++ = '.';
    *q++ = (char)('0' + ((mv / 100) % 10));
    *q++ = (char)('0' + ((mv / 10) % 10));
    *q++ = 'V';

    uint8_t rec[96];
    uint16_t n = oepl_nfc_make_text(rec, sizeof(rec), text, (uint8_t)(q - text));
    if (n) oepl_nfc_write_user(rec, n);
}

