knyghtryda/oepl-cc2630-firmware/firmware/main.c
    // --- Boot message ---
    rtt_puts("RST=");
    rtt_put_hex8((uint8_t)SysCtrlResetSourceGet());
    rtt_puts(" IOC=");
    rtt_put_hex8(ioc_frozen ? 1 : 0);
    rtt_puts(" WARM=");
    rtt_put_hex8(warm_boot ? 1 : 0);
    rtt_puts("\r\n");


    if (!warm_boot) stack_paint();


    // The JTAG power domain is left on by the ROM boot. Nothing needs it once
    // the tag is running on its own, and TI's Power driver turns it off for
    // the same reason. Keep it on while a debugger is actually attached, or
    // the session dies on the next sleep.
#ifndef BENCH_JTAG_STAYS_ON
    if (!debugger_attached()) {
        AONWUCJtagPowerOff();
    }
#endif

    // Watchdog: from here on anything that hangs for ~90s gets reset.
    oepl_hw_wdt_init();

    // A watchdog reset is a warm reset with no fault record: synthesise one
    // so it is reported like a crash (PC 0xDEADD006 = watchdog). Standby
    // wakeups also come through reset, so only a cold boot counts.
    if (!warm_boot && SysCtrlResetSourceGet() == RSTSRC_WARMRESET &&
        !fault_record_valid(&g_fault)) {
        g_fault.pc = FAULT_PC_WATCHDOG;
        g_fault.lr = g_fault.sp = g_fault.cfsr = g_fault.bfar = 0;
        fault_record_seal(&g_fault);
    }

#ifdef DIAG_SLEEP_ONLY
    // make DIAG_SLEEP_ONLY=1: every DIO high-impedance except DIO5 (panel
    // supply) held low and DIO11 (SPI flash CS) held high, no radio, no
    // display -- just standby in a loop. The
    // PPK2 reading is then the MCU + board floor with nothing driven.
    // Pin sweep for hunting the board's sleep floor: DIAG_PIN_MODE picks what
    // the pins in DIAG_PIN_MASK get instead of hi-Z (0 = none/hi-Z, 1 = pull
    // down, 2 = pull up, 3 = driven low, 4 = driven high). A load fed through
    // a pin shows up as a step in the standby current for the group that
    // feeds it. Defaults reproduce the plain hi-Z build.
#ifndef DIAG_PIN_MODE
#define DIAG_PIN_MODE 0
#endif
#ifndef DIAG_PIN_MASK
#define DIAG_PIN_MASK 0xFFFFFFFFu
#endif
    for (uint8_t dio = 0; dio <= 30; dio++) {
        if (dio == 5 || dio == 11) continue;
        bool swept = (DIAG_PIN_MODE != 0) && ((DIAG_PIN_MASK >> dio) & 1);
        if (swept && DIAG_PIN_MODE >= 3) {
            IOCPinTypeGpioOutput(dio);
            GPIO_setOutputEnableDio(dio, GPIO_OUTPUT_ENABLE);
            if (DIAG_PIN_MODE == 3) GPIO_clearDio(dio); else GPIO_setDio(dio);
            continue;
        }
        uint32_t pull = IOC_NO_IOPULL;
        if (swept) pull = (DIAG_PIN_MODE == 1) ? IOC_IOPULL_DOWN : IOC_IOPULL_UP;
        GPIO_setOutputEnableDio(dio, GPIO_OUTPUT_DISABLE);
        IOCPortConfigureSet(dio, IOC_PORT_GPIO, pull | IOC_INPUT_DISABLE);
    }
    rtt_puts("PIN SWEEP mode=");
    rtt_put_hex8(DIAG_PIN_MODE);
    rtt_puts(" mask=");
    rtt_put_hex32(DIAG_PIN_MASK);
    rtt_puts("\r\n");
    IOCPinTypeGpioOutput(5);
    GPIO_setOutputEnableDio(5, GPIO_OUTPUT_ENABLE);
    GPIO_clearDio(5);   // panel supply off (high = on: +160 uA measured)
    IOCPinTypeGpioOutput(11);          // SPI flash CS: deselected
    GPIO_setOutputEnableDio(11, GPIO_OUTPUT_ENABLE);
    GPIO_setDio(11);
    oepl_hw_flash_deep_sleep();
    GPIO_setOutputEnableDio(9, GPIO_OUTPUT_DISABLE);
    GPIO_setOutputEnableDio(10, GPIO_OUTPUT_DISABLE);
    IOCPortConfigureSet(9, IOC_PORT_GPIO, IOC_NO_IOPULL | IOC_INPUT_DISABLE);
    IOCPortConfigureSet(10, IOC_PORT_GPIO, IOC_NO_IOPULL | IOC_INPUT_DISABLE);

    rtt_puts("DIAG_SLEEP_ONLY\r\n");
    while (1) {
        enter_sleep(20);
        // What the power configuration actually looked like at the moment of
        // the sleep call. With a debugger attached the part never reaches
        // standby, but these are the registers that decide whether it would.
        static const char *names[] = { "wakes", "OSC_CTL0", "", "AONPWRSTAT",
                                       "AONCTL0", "JTAGCFG", "", "PDSTAT0",
                                       "PDSTAT1", "", "PDCTL1", "AUXCTL",
                                       "", "", "VDCTL", "magic" };
        for (uint8_t i = 0; i < 16; i++) {
            if (!names[i][0]) continue;
            rtt_puts(names[i]);
            rtt_puts("=");
            rtt_put_hex32(sleep_snap[i]);
            rtt_puts(" ");
        }
        rtt_puts("\r\n");
    }
#endif

    // Report the last OTA apply (written from RAM by apply_ota, read here on
    // the first boot of the image it installed)
    struct ota_apply_stat ota_stat = {0};
    bool ota_applied = oepl_ota_take_apply_report(&ota_stat);
    if (ota_applied) {
        rtt_puts("OTA apply: sectors=");
        rtt_put_hex8(ota_stat.sectors);
        rtt_puts(" retries=");
        rtt_put_hex8(ota_stat.retries);
        rtt_puts(" bad=");
        rtt_put_hex8(ota_stat.bad);
        rtt_puts("\r\n");
    }

    // Report a HardFault from the previous run (record written by the handler)
    bool had_fault = fault_record_valid(&g_fault);
    // A cold boot means any crash capture in RAM predates the power cycle
    // (SRAM keeps its contents for a moment) -- discard it, so tooling can't
    // mistake a stale capture for a fresh one.
    if (!had_fault) g_crash.magic = 0;
    g_fault.magic = 0;                 // consumed (or rejected): don't re-report
    struct fault_record last_fault = {0};
    char fault_str[40] = "";
    if (had_fault) {
        last_fault = g_fault;
        rtt_puts("LAST FAULT: PC="); rtt_put_hex32(last_fault.pc);
        rtt_puts(" LR="); rtt_put_hex32(last_fault.lr);
        rtt_puts(" SP="); rtt_put_hex32(last_fault.sp);
        rtt_puts(" CFSR="); rtt_put_hex32(last_fault.cfsr);
        rtt_puts(" BFAR="); rtt_put_hex32(last_fault.bfar);
        rtt_puts("\r\n");
        // Shown in red on the splash so a sealed tag's crash can be read off
        // the panel: "FAULT PC=xxxxxxxx CFSR=xxxxxxxx"
        static const char hexd[] = "0123456789ABCDEF";
        char *q = fault_str;
        memcpy(q, "FAULT PC=", 9); q += 9;
        for (int i = 28; i >= 0; i -= 4) *q++ = hexd[(last_fault.pc >> i) & 0xF];
        memcpy(q, " CFSR=", 6); q += 6;
        for (int i = 28; i >= 0; i -= 4) *q++ = hexd[(last_fault.cfsr >> i) & 0xF];
        *q = 0;
    }

    // Print MAC in human-readable form
    uint8_t mac[8];
    oepl_rf_get_mac(mac);
    rtt_puts("MAC: ");
    print_mac_msb(mac);
    rtt_puts("\r\n");

