knyghtryda/oepl-cc2630-firmware/firmware/main.c
    // --- Board peripherals to their low-power state ---
    // Panel: unpowered, lines released. Don't run uc8159_init() here: it
    // powers the panel, and nothing would power it off again before standby;
    // both draw paths call uc8159_wake(). External flash: deep power-down.
    oepl_hw_gpio_init();
    oepl_hw_epd_pins_off();
#ifndef BENCH_NO_FLASH_DPD
    // Deep power-down for the external SPI flash. Done on every boot, not
    // just a cold one: a warm boot (our own reset) leaves it in standby,
    // which costs far more than deep power-down on a typical SPI NOR.
    oepl_hw_flash_deep_sleep();
#endif

    // --- NFC chip (a per-variant option; absent boards just skip it) ---
    if (!warm_boot && oepl_nfc_init()) nfc_write_identity();

    // --- Initialize RF core ---
    rf_status_t rc = oepl_rf_init();
    if (rc != RF_OK) {
        rtt_puts("RF init FAILED: ");
        rtt_put_hex8(rc);
        rtt_puts("\r\n");
        goto idle;
    }
    rtt_puts("RF init OK\r\n");

    // --- Initialize OEPL radio protocol layer ---
    oepl_radio_init();

    // --- Splash screen only on cold boot ---
    if (!warm_boot) {
        rtt_puts("SPLASH: drawing\r\n");
        oepl_radio_set_wakeup_reason(WAKEUP_REASON_SPLASH);
        int8_t splash_ch = oepl_radio_scan_channels();
        int8_t temp_c;
        uint16_t bat_mv;
        oepl_hw_get_temperature(&temp_c);
        oepl_hw_get_voltage(&bat_mv);
        radio_state_t *rst = oepl_radio_get_state();
        splash_display(mac, bat_mv, temp_c, splash_ch >= 0, rst->current_ieee_ch,
                       had_fault ? fault_str : NULL);
        rtt_puts("SPLASH: done\r\n");
    } else {
        rtt_puts("WARM BOOT: skipping splash\r\n");
    }

#ifdef BENCH_PIN_WATCH
    bench_pin_watch();
#endif

#ifdef BENCH_SPLASH_LOOP
    // Bench: refresh the panel, sleep, refresh again. Checks that the state
    // the pins are left in during standby still lets the panel come back.
    for (int bi = 0; bi < 3; bi++) {
        enter_sleep(20);
        int8_t bt; uint16_t bv;
        oepl_hw_get_temperature(&bt);
        oepl_hw_get_voltage(&bv);
        rtt_puts("BENCH: refresh after sleep\r\n");
        splash_display(mac, bv, bt, true, 11, NULL);
        rtt_puts("BENCH: refresh done\r\n");
    }
#endif

    // Tell the AP the first checkin after a crash is a fault reset (0xFE);
    // it shows up as wakeupReason in the AP tag DB, with the fault PC/status
    // encoded in that one checkin's battery/temperature/LQI fields.
    if (had_fault) {
        oepl_radio_set_wakeup_reason(WAKEUP_REASON_WDT_RESET);
        if (last_fault.pc == FAULT_PC_RF_DOORBELL) {
            uint32_t op = last_fault.lr;
            uint16_t cmd = (op & 1) ? (uint16_t)(0x8000 | ((op >> 16) & 0x7FFF))
                                    : (uint16_t)(op & 0x7FFF);
            oepl_radio_set_fault_report(FAULT_CLASS_DOORBELL, cmd,
                                        (uint8_t)((last_fault.sp & 3) << 6 | (last_fault.cfsr & 0x3F)));
        } else if (last_fault.pc == FAULT_PC_WATCHDOG) {
            oepl_radio_set_fault_report(FAULT_CLASS_WATCHDOG, 0, 0);
        } else {
            uint8_t cls = FAULT_CLASS_HARDFAULT | ((last_fault.pc >> 16) & 3) |
                          (((last_fault.pc >> 28) == 2) ? 4 : 0);
            oepl_radio_set_fault_report(cls, (uint16_t)(last_fault.pc & 0xFFFF),
                                        (uint8_t)((((last_fault.cfsr >> 16) & 0xF) << 4) |
                                                  ((last_fault.cfsr >> 8) & 0xF)));
        }
    }

    // A tag in standby can't be probed over JTAG, so how the apply went rides
    // to the AP in the first check-in after it, on the same telemetry channel
    // as a fault report (a real fault takes precedence).
    if (ota_applied && !had_fault) {
        oepl_radio_set_fault_report(FAULT_CLASS_OTA_APPLY,
                                    (uint16_t)(ota_stat.retries << 8 | ota_stat.bad),
                                    ota_stat.sectors);
    }

    // --- Main loop: periodic checkin + sleep ---
    // Standby (RTC wakeup) between every check-in.
    //
    // Back-off: when the AP can't be reached (AP down, out of range) or an
    // update can't be completed, retry after 30 s, 60 s, 120 s ... up to
    // 15 min instead of every 30 s. A failed check-in can cost ~30 s of
    // receive (scan plus direct check-in on every channel) and a failed
    // download up to a couple of minutes at ~8 mA; at a fixed 30 s retry a
    // tag in a bad spot could spend tens of mAh a day on nothing. 15 min
    // stays inside the AP's 20-minute window for pending data.
    uint32_t checkin_count = 0;
    uint8_t checkin_fail_streak = 0;
    uint32_t xfer_hold_until = 0;      // AON RTC second to allow transfers again
    uint64_t xfer_hold_ver = 0;        // the dataVer that earned the hold
    uint8_t xfer_fail_streak = 0;
    while (1) {
        rtt_puts("\r\nstack free=");
        rtt_put_hex32(stack_free());
        rtt_puts("\r\n=== Checkin #");
        rtt_put_hex32(checkin_count);
        rtt_puts(" ===\r\n");

        struct AvailDataInfo info;
        memset(&info, 0, sizeof(info));

#ifdef BENCH_FORCE_CHECKIN_FAIL
        bool checkin_ok = false;
#else
        bool checkin_ok = do_scan_and_checkin(&info);
#endif
        if (oepl_rf_hung()) {
            // Radio core wedged during this check-in: report it once and let
            // the shutdown/re-init either side of the next sleep clear it.
            uint32_t op = oepl_rf_hung_op();
            uint16_t cmd = (op & 1) ? (uint16_t)(0x8000 | ((op >> 16) & 0x7FFF))
                                    : (uint16_t)(op & 0x7FFF);
            oepl_radio_set_fault_report(FAULT_CLASS_DOORBELL, cmd,
                                        (uint8_t)((oepl_rf_hung_phase() & 3) << 6 |
                                                  oepl_rf_hung_cmdsta()));
            rtt_puts("RF hung: recovering at next wake\r\n");
            oepl_rf_hung_clear();
            checkin_ok = false;
        }
        uint32_t wait_sec;

        if (checkin_ok) {
            checkin_fail_streak = 0;
            rtt_puts("Checkin OK: dataType=");
            rtt_put_hex8(info.dataType);
            rtt_puts(" nextCheckIn=");
            rtt_put_hex8((info.nextCheckIn >> 8) & 0xFF);
            rtt_put_hex8(info.nextCheckIn & 0xFF);
            rtt_puts("\r\n");

            bool xfer_failed = false;
            bool xfer_done = false;   // only a completed update clears the failure streak
            // After a failed transfer the *transfer* backs off, not the
            // check-in: a tag that stops checking in looks dead to the AP for
            // up to RETRY_MAX_S, and an image the tag keeps rejecting would
            // otherwise cost a 21 KB download every minute. So keep the AP's
            // cadence and just refuse to start a new transfer until the hold
            // expires. AON RTC seconds survive standby.
            // A different dataVer means the AP is offering something new —
            // most likely the fix for whatever was failing — so it gets a
            // fresh attempt rather than inheriting the old hold. Not a free
            // one, though: an AP with several transfers queued offers a
            // different dataVer every check-in, and clearing the hold outright
            // turns that into a continuous download loop (seen on the bench).
            // Shrink the hold to one check-in instead of dropping it.
            if (xfer_hold_until && info.dataVer != xfer_hold_ver) {
                xfer_fail_streak = 0;
                uint32_t floor = AONRTCSecGet() + RETRY_MIN_S;
                if (xfer_hold_until > floor) xfer_hold_until = floor;
            }
            bool xfer_held = xfer_hold_until && (AONRTCSecGet() < xfer_hold_until);
            if (xfer_held && info.dataType != DATATYPE_NOUPDATE) {
                rtt_puts("Transfer held ");
                rtt_put_hex32(xfer_hold_until - AONRTCSecGet());
                rtt_puts("s more after x");
                rtt_put_hex8(xfer_fail_streak);
                rtt_puts(" failures\r\n");
                oepl_radio_set_wakeup_reason(WAKEUP_REASON_TIMED);
            } else if (info.dataType == DATATYPE_FW_UPDATE) {
                if (oepl_ota_already_applied(info.dataVer)) {
                    rtt_puts("OTA: already applied, sending XferComplete\r\n");
                    oepl_radio_send_xfer_complete();
                    xfer_done = true;
                } else {
                    rtt_puts("*** FW UPDATE ***\r\n");
                    oepl_ota_download_and_apply(&info);
                    // Returns only on failure — will retry next checkin
                    rtt_puts("FW update failed, retry later\r\n");
                    xfer_failed = true;
                }
            } else if (info.dataType != DATATYPE_NOUPDATE) {
#ifdef BENCH_FORCE_XFER_FAIL
                bool shown = false;
#else
                bool shown;
                if (info.dataType == DATATYPE_NFC_RAW_CONTENT ||
                    info.dataType == DATATYPE_NFC_URL_DIRECT) {
                    shown = download_and_write_nfc(&info);
                } else if (info.dataType == DATATYPE_IMG_ZLIB) {
                    shown = download_and_display_zlib(&info);
                } else {
                    shown = download_and_display(&info);
                }
#endif
                if (shown) {
                    rtt_puts("*** IMAGE DISPLAYED ***\r\n");
                    xfer_done = true;
                } else {
                    rtt_puts("Display failed, will retry\r\n");
                    xfer_failed = true;
                }
                oepl_radio_set_wakeup_reason(WAKEUP_REASON_TIMED);
            } else {
                rtt_puts("No pending data\r\n");
                oepl_radio_set_wakeup_reason(WAKEUP_REASON_TIMED);
            }

            // AP sends nextCheckIn in minutes; convert to seconds
            wait_sec = (uint32_t)info.nextCheckIn * 60;
            if (wait_sec < RETRY_MIN_S) wait_sec = RETRY_MIN_S;
            if (wait_sec > 3600) wait_sec = 3600;

            if (xfer_failed) {
                if (xfer_fail_streak < 8) xfer_fail_streak++;
                xfer_hold_until = AONRTCSecGet() + retry_backoff_s(xfer_fail_streak);
                xfer_hold_ver = info.dataVer;
                rtt_puts("Update failed x");
                rtt_put_hex8(xfer_fail_streak);
                rtt_puts(", holding transfers ");
                rtt_put_hex32(retry_backoff_s(xfer_fail_streak));
                rtt_puts("s\r\n");
            } else if (xfer_done) {
                // (A "no pending data" check-in doesn't reset it: the AP can
                // flap between offering and not offering the same image.)
                xfer_fail_streak = 0;
                xfer_hold_until = 0;
            }
        } else {
            wait_sec = retry_backoff_s(checkin_fail_streak);
            if (checkin_fail_streak < 8) checkin_fail_streak++;
            rtt_puts("Checkin failed x");
            rtt_put_hex8(checkin_fail_streak);
            rtt_puts(", back off\r\n");
        }

#ifdef BENCH_TEST_HARDFAULT
        // Bench: a real bus fault (RF core registers with the domain off) on the
        // 3rd check-in, to verify the HardFault record against a known location
        if (checkin_count == 2) {
            rtt_puts("BENCH: forcing HardFault\r\n");
            PRCMPowerDomainOff(PRCM_DOMAIN_RFCORE);
            oepl_rf_rx_stop();
        }
#endif
#ifdef BENCH_TEST_DOORBELL_HANG
        // Bench: provoke a doorbell timeout (RF core powered off, then abort)
        // on the 3rd check-in to exercise crash capture and the fault report.
        if (checkin_count == 2) {
            rtt_puts("BENCH: forcing doorbell hang\r\n");
            HWREG(RFC_PWR_NONBUF_BASE + RFC_PWR_O_PWMCLKEN) = 0;   // RFCClockDisable(): CPE stops answering
            oepl_rf_rx_stop();
        }
#endif
        enter_sleep(wait_sec);

